'use client'
import Link from "next/link";
import {useRouter} from "next/navigation";
import {useHelpInfoModal} from "@/store";
import HeadPage from "@/components/ui/HeadPage";
import translations from "@/translations";
import {useLocale} from "@/context/locale";

export default function HelpIn() {
  const {locale} = useLocale()
  const router = useRouter()
  const {toggleModal, setData, inData} = useHelpInfoModal()

  const helpVariants = [[{
    id: 0, text: 'Банкротство туроператора', textKk: 'Туроператордың банкротқа ұшыруы', ispPrevInfo: false
  }, {
    id: 1, text: 'Угроза жизни и здоровью туриста', textKk: 'Туристің өмірі мен денсаулығына қауіп тиуі', ispPrevInfo: false
  }, {
    id: 2, text: 'Введение чрезвычайного положения', textKk: 'Төтенше жағдай енгізу', ispPrevInfo: false
  },], [{
    id: 0, text: 'Банкротство туроператора', textKk: 'Туроператордың банкротқа ұшыруы', ispPrevInfo: false
  }, {
    id: 1, text: 'Мошеннические действия турагентства', textKk: 'Турагенттің алаяқтық әрекеттері', ispPrevInfo: false
  }, {
    id: 2, text: 'Необоснованное незаселение со стороны отеля', textKk: 'Қонақ үй тарапынан негізсіз қоныстанбау', ispPrevInfo: false
  },], [{
    id: 0, text: 'По объективным причинам со стороны туриста (болезнь и т.д.)', textKk: 'Турист тарапынан маңызды себептер бойынша (ауру және т.б.)', ispPrevInfo: false,
    content: `<div class="modal__text-info">
          <ol>
            <li>
              <p>
                Сбор документов, подтверждающих факт невозможности вылета в страну отдыха.
              </p>
              <div class="tooltip-wrap">
                   <div class="tooltip-btn" data-tooltip-id="my-tooltip" data-tooltip-variant="info" data-tooltip-place="right-start" data-tooltip-content="С приложением подтверждающих документов (справка, выписка лечебного учреждения, заверенная лечебным учреждением).">
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M12 22C17.5 22 22 17.5 22 12C22 6.5 17.5 2 12 2C6.5 2 2 6.5 2 12C2 17.5 6.5 22 12 22Z" fill="white"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M12 7.25C12.4142 7.25 12.75 7.58579 12.75 8V13C12.75 13.4142 12.4142 13.75 12 13.75C11.5858 13.75 11.25 13.4142 11.25 13V8C11.25 7.58579 11.5858 7.25 12 7.25Z" fill="#D5251B"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M10.9945 16C10.9945 15.4477 11.4422 15 11.9945 15H12.0035C12.5558 15 13.0035 15.4477 13.0035 16C13.0035 16.5523 12.5558 17 12.0035 17H11.9945C11.4422 17 10.9945 16.5523 10.9945 16Z" fill="#D5251B"/>
                    </svg>
                  </div>
              </div>
            </li>
            <li>
              <p>Оформление и направление заявления о возврате средств в адрес туроператора, турагентства в соответствии с заключённым договором на туристическое обслуживание (согласно п. 6 ст. 17 Закона о турист.деятельности).</p>
            </li>
            <li>
              <p>
                Получение средств согласно условиям заключённого договора на туристское обслуживание.
              </p>
            </li>
            <li>
              <p>
                В случае не согласия с представленным ответом турагентства/ туроператора предъявить письменную претензию согласно Закона о защите прав потребителей.
              </p>
            </li>
            <li>
              <p>
                В случае отказа в удовлетворении претензии либо не согласии с заявленными условиями туроператора/ турагента обратится с иском в суд согласно действующего законодательства (ГПК,ГК, Закона о защите прав потребителей, Закона о туристкой деятельности).
              </p>
            </li>
          </ol>
      </div>`,
    contentKk: `<div class="modal__text-info">
          <ol>
            <li>
              <p>
                Саяхат еліне кетудің мүмкін еместігі фактісін растайтын құжаттар жинағы.
              </p>
              <div class="tooltip-wrap">
                   <div class="tooltip-btn" data-tooltip-id="my-tooltip" data-tooltip-variant="info" data-tooltip-place="right-start" data-tooltip-content="Растайтын құжаттарды қамтамасыз ету қажет (анықтама, медициналық мекеме куәландырған медициналық мекемеден үзінді көшірме)">
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M12 22C17.5 22 22 17.5 22 12C22 6.5 17.5 2 12 2C6.5 2 2 6.5 2 12C2 17.5 6.5 22 12 22Z" fill="white"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M12 7.25C12.4142 7.25 12.75 7.58579 12.75 8V13C12.75 13.4142 12.4142 13.75 12 13.75C11.5858 13.75 11.25 13.4142 11.25 13V8C11.25 7.58579 11.5858 7.25 12 7.25Z" fill="#D5251B"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M10.9945 16C10.9945 15.4477 11.4422 15 11.9945 15H12.0035C12.5558 15 13.0035 15.4477 13.0035 16C13.0035 16.5523 12.5558 17 12.0035 17H11.9945C11.4422 17 10.9945 16.5523 10.9945 16Z" fill="#D5251B"/>
                    </svg>
                  </div>
              </div>
            </li>
            <li>
              <p>Туристік қызмет көрсетуге жасалған шартқа сәйкес туроператорға, турагенттікке ақшаны қайтару туралы өтінішті рәсімдеу және жіберу (Туристік қызмет туралы заңның 17-бабының 6-тармағына сәйкес)</p>
            </li>
            <li>
              <p>
                Туристік қызмет көрсетуге жасалған шарттың талаптарына сәйкес қаражат алу
              </p>
            </li>
            <li>
              <p>
                Туристік агенттіктің / туроператордың берілген жауабымен келіспеген жағдайда, Тұтынушылардың құқықтарын қорғау туралы заңға сәйкес жазбаша талап-арыз жіберіңіз.
              </p>
            </li>
            <li>
              <p>
                Талапты қанағаттандырудан бас тартқан немесе көрсетілген шарттармен келіспеген жағдайда туроператор/турагент қолданыстағы заңнамаға сәйкес сотқа талап қою қажет. (ҚІЖК, Азаматтық кодекс, Тұтынушылардың құқықтарын қорғау туралы заң, Қазақстан Республикасы Тұтынушылардың құқықтарын қорғау туралы заң, Қазақстан Республикасы Тұтынушылардың құқықтарын қорғау туралы Заң, Туристік қызмет туралы заң).
              </p>
            </li>
          </ol>
      </div>`,
  }, {
    id: 1, text: 'По семейным или иным причинам', textKk: 'Отбасылық немесе басқа себептермен', ispPrevInfo: false,
    content: `<div class="modal__text-info">
          <ol>
            <li>
              <p>
                Письменное обращение в адрес турагентства/туроператора с приложение документов причины отказа от услуг туроператора/турагентства.
              </p>
              <div class="tooltip-wrap">
                   <div class="tooltip-btn" data-tooltip-id="my-tooltip" data-tooltip-variant="info" data-tooltip-place="top-start" data-tooltip-html='
                   <div class="tooltip-content-wrap">
                   <ul>
                   <li>Сбор письменных доказательств (справки, свидетельства, и прочие  документы), подтверждающий факт наступления невозможности вылета.</li>
                   <li>Во избежание риска утраты расходов произведенные по условиям договора на туристское обслуживание, турист вправе заключить договор добровольного страхования расходов лиц, выезжающих за границу РК, в связи с отменой поездки (ст. 806 Гражд.кодекса предусмотрено также добровольное страхование).</li>
                   <li>Договор добров.страхования заключается по волеизъявлению самого заявителя, и страхов.компанией. Виды, условия и порядок добров.страхования определяются соглашением сторон.</li>
                   <li>Страховым случаем будет является факт возникновения в период действия договора на туристическое обслуживание убытков Застрахованного, вызванных внезапной, непредвиденной отменой запланированной, полностью оплаченной поездки за границу (смерть, болезнь близкого родственника, травмы, заболевания застрахованного или близкого родственника, повреждение или гибель имущества и пр.).</li>
                   <li>Договор добровольного страхования должен быть заключен не позднее 10 календарных дней до начала запланированной поездки. Вступает в силу со дня следующего за днем оплаты стразовой премии. Страховая сумма, страховая премия определяется соглашением сторон.</li>
                   <li>При наступлении страхового случая, определённое условием договора добровольного страхования, заявитель/ застрахованный вправе требовать от Страховщика осуществить страховую выплату; при отказе Страховщика совершении указанных действий оспорить их в судебном порядке.</li>
                   </ul>
                   </div>'
                   >
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M12 22C17.5 22 22 17.5 22 12C22 6.5 17.5 2 12 2C6.5 2 2 6.5 2 12C2 17.5 6.5 22 12 22Z" fill="white"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M12 7.25C12.4142 7.25 12.75 7.58579 12.75 8V13C12.75 13.4142 12.4142 13.75 12 13.75C11.5858 13.75 11.25 13.4142 11.25 13V8C11.25 7.58579 11.5858 7.25 12 7.25Z" fill="#D5251B"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M10.9945 16C10.9945 15.4477 11.4422 15 11.9945 15H12.0035C12.5558 15 13.0035 15.4477 13.0035 16C13.0035 16.5523 12.5558 17 12.0035 17H11.9945C11.4422 17 10.9945 16.5523 10.9945 16Z" fill="#D5251B"/>
                    </svg>
                  </div>
              </div>
            </li>
            <li>
              <p>Рассмотрение заявления туроператором/турагентством заявленных требований в установленные законодательством сроки.</p>
            </li>
            <li>
              <p>
                Получение средств согласно условиям договора, заключенного между туроператором и турагентством.
              </p>
            </li>
            <li>
              <p>
               В случае отказа в удовлетворении претензий либо не согласии с условиями туроператора/турагента обратится в суд с иском согласно действующего законодательства.
              </p>
            </li>
          </ol>
      </div>`,
    contentKk: `<div class="modal__text-info">
          <ol>
            <li>
              <p>
                Туроператордың/туроператордың қызметтерінен бас тарту себептері құжаттарының тіркелуімен турагенттіктің/туроператордың атына жазбаша өтініш
              </p>
              <div class="tooltip-wrap">
                   <div class="tooltip-btn" data-tooltip-id="my-tooltip" data-tooltip-variant="info" data-tooltip-place="top-start" data-tooltip-html='
                   <div class="tooltip-content-wrap">
                   <ul>
                   <li>Ұшып шығу мүмкінсіздігі фактісін растайтын жазбаша дәлелдемелерді (анықтамаларды, куәліктерді және т.б.) жинау</li>
                   <li>Туристік қызмет көрсету шартының талаптары бойынша жүргізілген шығыстардың жоғалу тәуекелін болдырмау үшін туристік сапардың күшін жоюға байланысты ҚР шетелге шығатын адамдардың шығыстарын ерікті сақтандыру шартын жасауға құқылы (Азаматтық кодекстің 806-бабына ерікті сақтандыру көзделген)</li>
                   <li>Ерікті сақтандыру шарты өтініш берушінің және сақтандыру компаниясының өз еркі бойынша жасалады. Ерікті сақтандырудың түрлері, шарттары мен тәртібі тараптардың келісімімен айқындалады.</li>
                   <li>Туристік қызмет көрсетуге арналған шарттың қолданылу кезеңінде жоспарланған толық төленген шетелге шығудың кенеттен, күтпеген күшін жоюдан туындаған (жақын туысының өлімі, ауруы, жарақаты, сақтандырылған адамның немесе жақын туысының ауруы, мүлкінің зақымдануы немесе жойылуы және т.б.) Сақтандырылған адамның шығындарының туындау фактісі сақтандыру жағдайы болып табылады.</li>
                   </ul>
                   </div>'
                   >
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M12 22C17.5 22 22 17.5 22 12C22 6.5 17.5 2 12 2C6.5 2 2 6.5 2 12C2 17.5 6.5 22 12 22Z" fill="white"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M12 7.25C12.4142 7.25 12.75 7.58579 12.75 8V13C12.75 13.4142 12.4142 13.75 12 13.75C11.5858 13.75 11.25 13.4142 11.25 13V8C11.25 7.58579 11.5858 7.25 12 7.25Z" fill="#D5251B"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M10.9945 16C10.9945 15.4477 11.4422 15 11.9945 15H12.0035C12.5558 15 13.0035 15.4477 13.0035 16C13.0035 16.5523 12.5558 17 12.0035 17H11.9945C11.4422 17 10.9945 16.5523 10.9945 16Z" fill="#D5251B"/>
                    </svg>
                  </div>
              </div>
            </li>
            <li>
              <p>Туроператордың/турагенттіктің заңнамада белгіленген мерзімдерде мәлімделген талаптарды қарауы</p>
            </li>
            <li>
              <p>
                Туроператор мен турагенттік арасында жасалған келісім шарттарына сәйкес қаражат алу.
              </p>
            </li>
            <li>
              <p>
               Талапты қанағаттандырудан бас тартқан не туроператордың/турагенттің шарттарымен келіспеген жағдайда қолданыстағы заңнамаға сәйкес талап-арызбен сотқа жүгіну
              </p>
            </li>
          </ol>
      </div>`,
  }, {
    id: 2, text: 'Банкротство туроператора', textKk: 'Туроператордың банкроттығы', ispPrevInfo: false,
    content: `<div class="modal__text-info">
          <ol>
            <li>
              <p>
                Связаться с лицом с кем был заключен договор с уточнением требований. Фиксировать все действия при отказе от оказания услуг исполнителем (переписка WhatsApp, email, фискальные чеки, квитанции и пр.).
              </p>
            </li>
            <li>
              <p>Незамедлительно оформить письменную претензию/требование в адрес лица, с кем был заключен договор на туристское обслуживание с приложением всех подтверждающих документов (договор, документы об оплате, переписки, и пр.), чтобы была возможность получить деньги до начала процедуры банкротства.</p>
              <ul>
                <li>
                  В случае если процедура банкротства началась: после возбуждения процедуры банкротства на  основании определения суда, но до вынесения окончательного решения, предъявить треб ования временному управляющему, назначаемого определением суда согласно Закона о реабилитации и банкротстве.
                 </li>
                 <li>
                  В случае если состоялось решение суда о признании банкротом туроператора, предъявить требования о взыскании долга банкротному управляющему.
                 </li>
              </ul>
            </li>
            <li>
              <p>
                Получить письменное уведомление от временного/банкротного управляющего о признании требований кредитора, т.е. заявителя/туриста в полном объеме или в части. При этом кредитор вправе обжаловать принятое решение временного управляющего в судебном порядке (ст. 91 Закона о реабилитации и банкротстве).
              </p>
              <div class="tooltip-wrap">
                 <div class="tooltip-btn" data-tooltip-id="my-tooltip" data-tooltip-variant="info" data-tooltip-place="right-start" data-tooltip-content="Заявитель/кредитор вправе обжаловать принятое решение суда в вышестоящие судебные инстанции согласно установленным требованиям процессуального законодательства.">
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M12 22C17.5 22 22 17.5 22 12C22 6.5 17.5 2 12 2C6.5 2 2 6.5 2 12C2 17.5 6.5 22 12 22Z" fill="white"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M12 7.25C12.4142 7.25 12.75 7.58579 12.75 8V13C12.75 13.4142 12.4142 13.75 12 13.75C11.5858 13.75 11.25 13.4142 11.25 13V8C11.25 7.58579 11.5858 7.25 12 7.25Z" fill="#D5251B"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M10.9945 16C10.9945 15.4477 11.4422 15 11.9945 15H12.0035C12.5558 15 13.0035 15.4477 13.0035 16C13.0035 16.5523 12.5558 17 12.0035 17H11.9945C11.4422 17 10.9945 16.5523 10.9945 16Z" fill="#D5251B"/>
                  </svg>
                </div>
              </div>
            </li>
          </ol>
      </div>`,
    contentKk: `<div class="modal__text-info">
          <ol>
            <li>
              <p>
                Талаптарды нақтылау барысында, шартты жасаған адаммен байланысу керек. Орындаушы қызмет көрсетуден бас тартқан кезде барлық әрекеттерді (WhatsApp, email арқылы хат алмасу, фискалдық чектер, түбіртектер және т.б. жинау) талаптарды ескере отырып белгілеу. Орындаушы қызмет көрсетуден бас тартқан кезде барлық әрекеттерді белгілеу (WhatsApp, email арқылы хат алмасу, фискалдық чектер, түбіртектер және т.б. жинау)
              </p>
            </li>
            <li>
              <p>Банкроттық рәсім басталғанға дейін ақшаны алу мүмкіндігі болу үшін туристік қызмет көрсетуге шарт жасалған адамның атына барлық растайтын құжаттарды (шарт, төлем туралы құжаттар, хат алмасу және т.б.) тіркеп, дереу жазбаша талап рәсімдеу.</p>
            </li>
            <li>
              <p>
                Уақытша/банкроттықты басқарушыдан кредитордың, яғни өтініш берушінің/туристің талаптарын толық көлемде немесе бір бөлігінде тану туралы жазбаша хабарлама алуы тиім. Бұл ретте кредитор уақытша басқарушының қабылдаған шешіміне сот тәртібімен шағымдануға құқылы (Оңалту және банкроттық туралы заңның 91-бабы)
              </p>
              <div class="tooltip-wrap">
                 <div class="tooltip-btn" data-tooltip-id="my-tooltip" data-tooltip-variant="info" data-tooltip-place="right-start" data-tooltip-content="Өтініш беруші/кредитор сот шешімін жоғары тұрған сот сатыларына іс жүргізу заңнамасының белгіленген талаптарына сәйкес шағымдануға құқылы.">
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M12 22C17.5 22 22 17.5 22 12C22 6.5 17.5 2 12 2C6.5 2 2 6.5 2 12C2 17.5 6.5 22 12 22Z" fill="white"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M12 7.25C12.4142 7.25 12.75 7.58579 12.75 8V13C12.75 13.4142 12.4142 13.75 12 13.75C11.5858 13.75 11.25 13.4142 11.25 13V8C11.25 7.58579 11.5858 7.25 12 7.25Z" fill="#D5251B"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M10.9945 16C10.9945 15.4477 11.4422 15 11.9945 15H12.0035C12.5558 15 13.0035 15.4477 13.0035 16C13.0035 16.5523 12.5558 17 12.0035 17H11.9945C11.4422 17 10.9945 16.5523 10.9945 16Z" fill="#D5251B"/>
                  </svg>
                </div>
              </div>
            </li>
          </ol>
      </div>`,
  }, {
    id: 3, text: 'Мошеннические действия турагента', textKk: 'Турагенттің алаяқтық әрекеттері', ispPrevInfo: true,
    content: `<div class="modal__text-info">
          <ol>
            <li>
              <p>
                Обратится с заявлением на основании документов по приобретенному туру в правоохранительные органы по месту совершения преступления, т.е. по месту заключения договора и передачи денег согласно уголовному процессуальному кодексу (далее- УПК), а также предъявление гражданского иска в рамках возбужденного уголовного дела (ст. 166 УПК).
              </p>
            </li>
            <li>
              <p>После регистрации заявления, предоставить письменное пояснение по факту преступного деяния подозреваемого, получение постановления от следственных органов постановления о признании заявителя потерпевшим , с вытекающими всеми правами и обязанностями предусмотренные ст. 71 УПК РК</p>
            </li>
            <li>
              <p>
                Участие в процессе досудебного и судебного разрешения возбужденного уголовного дела, результатом которого является приговор суда о признании действий / бездействий турагента мошенничеством согласно ст. 190 УК и удовлетворение гражданского иска о возмещении материального ущерба, либо вынесение судом оправдательного приговора.
              </p>
            </li>
            <li>
              <p>
                Результат: приговор суда о признании действий/бездействий турагента мошенничеством согласно ст. 190 УК, и удовлетворении гражданского иска о возмещении материального ущерба, либо вынесение судом оправдательного приговора в отношении обвиняемого лица
              </p>
            </li>
          </ol>
      </div>`,
    contentKk: `<div class="modal__text-info">
          <ol>
            <li>
              <p>
                Сатып алынған тур бойынша құжаттар негізінде қылмыс жасалған жердегі құқық қорғау органдарына, яғни шартты жасау және қылмыстық процеске сәйкес ақшаны тапсыру орны бойынша (бұдан әрі – ҚІЖК), сондай-ақ қозғалған қылмыстық іс шеңберінде азаматтық талап қою бойынша өтініш беріңіз (ҚІЖК 166-бабы).
              </p>
            </li>
            <li>
              <p>Өтінішті тіркегеннен кейін күдіктінің қылмыстық іс-әрекеті фактісі бойынша жазбаша түсінктеме беру қажет, ҚР ҚІЖК 71-бабында көзделген барлық құқықтар мен міндеттерден туындайтын өтініш берушіні жәбірленуші деп тану туралы қаулының тергеу органдарынан қаулыысын алу керек.</p>
            </li>
            <li>
              <p>
                ҚК-нің 190-бабына сәйкес турагенттің әрекетін/әрекетсіздігін алаяқтық деп тану туралы сот үкімі және материалдық залалды өтеу туралы азаматтық талапты қанағаттандыру не соттың ақтау үкімін шығаруы нәтижесі болып табылатын қозғалған қылмыстық істі сотқа дейінгі және сотқа шешу процесіне қатысу.
              </p>
            </li>
            <li>
              <p>
                Нәтижесі: ҚК-нің 190-бабына сәйкес турагенттің әрекетін/әрекетсіздігін алаяқтық деп тану және материалдық залалды өтеу туралы азаматтық талапты қанағаттандыру туралы сот үкімі не соттың айыпталушыға қатысты ақтау үкімін шығаруы.
              </p>
            </li>
          </ol>
      </div>`,
  }, {
    id: 4, text: 'Отмена рейса авиакомпанией', textKk: 'Әуе компаниясының рейстен бас тартуы', ispPrevInfo: true,
    content: `<div class="modal__text-info">
          <p>
            При задержке или отмене рейсов по вине авиакомпании пассажир вправе требовать в зависимости от задержки прохладительные напитки, горячее питание.
          </p>
          <p>
            При задержке более 4 часов и далее: через каждые 6 час. – в дневное время; через каждые 8 час. – в ночное время), проживание в гостинице (при ожидании вылета рейса более 8 часов в дневное время и более 6 часов в ночное время), а также транспорт до гостиницы и обратно.
          </p>
          <p>
            Более того, согласно ст. 567 Кодекса об административное правонарушениях, перевозчик может быть привлечен к административной ответственности (санкция – штраф в размере 200МРП, при повторности совершения правонарушения – 1000 МРП).
          </p>
          <p>
            Когда гостиница предоставляется без взимания дополнительной платы, в случае просрочки доставки пассажира, перевозчик уплачивает штраф в размере 3% от стоимости тарифа (тарифа полетного участка, на котором произошла просрочка) за каждый час просрочки, согласно п. 3, п.4 ст. 86 Закон об использовании воздушного пространства.
          </p>
          <p>
            Также в случае задержки на 10 часов и более или отмене рейса по выбору пассажира оформляется перебронирование на ближайший рейс с предоставлением услуг либо полный возврат стоимости
           </p>
          <ol>
            <li>
              <p>
                Обратится с письменной претензией к авиаперевозчику , которая должна быть рассмотрена компанией в течении десяти дней, при этом компания должна предложить добровольный порядок возмещения причинённого пассажиру убытка (ст. 86 Закона об использовании воздушного пространства и деятельности авиации). 
              </p>
            </li>
            <li>
              <p>В случае отсутствия ответа в установленные сроки, пассажир в праве обратится в уполномоченный орган по защите прав потребителей по месту нахождения, либо в судебный органы с заявлением исковых требований о возмещений ущерба.</p>
            </li>
            <li>
              <p>
                Разрешения спора в судебном порядке, с вынесением соответствующего судебного акта об удовлетворении исковых требований заявителя либо мотивированный отказ в удовлетворении требований заявителя.
              </p>
            </li>
          </ol>
      </div>`,
    contentKk: `<div class="modal__text-info">
          <p>
            Әуе компаниясының кінәсінен рейстер кешіктірілген немесе тоқтатылған жағдайда жолаушы кешігуіне байланысты алкогольсіз сусындар, ыстық тамақ (егер 4 сағат не одан астам кешігу болса, : әрбір 8 сағат сайын күнделікті кезде, әрбір 6 сағат сайын түнде) талап етуге құқылы, қонақүйге орналастыру (рейсті күндіз 8 сағаттан астам және түнде 6 сағаттан астам күту кезінде), сондай-ақ қонақ үйге дейін және кері тасымалдау (Қонақ үй қосымша ақы алынбай берілген кезде, жолаушыны жеткізу кешіктірілген жағдайда, тасымалдаушы жол жүру құнының 3% мөлшерінде кешіктірілген әрбір сағат үшін айыппұл төлейді (кідіріс болған рейс бөлігінің тарифі)).
          </p>
          <p>
            Сондай-ақ, жолаушының таңдауы бойынша рейсті 10 сағат не одан аса кідірткен немесе алып тастаған жағдайда қызмет көрсетумен жақын маңдағы рейске ауыстыру не билет құнын толық қайтару рәсімделеді.
Бұдан басқа, Әкімшілік құқық бұзушылық туралы кодекстің 567-бабына сәйкес тасымалдаушы әкімшілік жауапкершілікке тартылуы мүмкін (санкция – 200 МРП, құқық бұзушылық қайталанған жағдайда – 1000 АЕК).
          </p>
          <p>
            Авиа тасымалдаушыға жазбаша шағыммен жүгінуі қажет, ол құжат компания он күн ішінде қарауы тиіс, бұл ретте компания жолаушыға келтірілген залалды өтеудің ерікті тәртібін ұсынуы тиіс (Әуе кеңістігін пайдалану және авиация қызметі туралы заңның 86-бабы).
          </p>
          <p>
            Белгіленген мерзімде жауап болмаған жағдайда, жолаушы тұтынушылардың құқықтарын қорғау жөніндегі уәкілетті органға орналасқан жері бойынша не сот органдарына залалды өтеу туралы талап-арызбен жүгінуі құқылы.
          </p>
          <p>
            Арыз берушінің талап қою талаптарын қанағаттандыру туралы тиісті сот актісін шығарумен дауды сот тәртібімен шешу не арыз берушінің талаптарын қанағаттандырудан дәлелді бас тарту.
           </p>
      </div>`,
  }]]

  const openModal = (ispPrevInfo, text, textKk, content, contentKk) => {
    if (+inData?.id === 0 || +inData?.id === 1) {
      router.push('/search')
    } else {
      toggleModal()
      const newObj = {
        text: text, textKk: textKk, content: content, contentKk: contentKk
      }
      setData(newObj)
    }
  }

  return (<div className='page-blank__container'>
    <div className="container">
      <div className="page-blank">
        <HeadPage title={locale === 'ru' ? inData?.title : inData?.titleKk}/>
        <div className="help-list__wrap">
          <ul className="help-list list-reset">
            {helpVariants && helpVariants[inData?.id] && helpVariants[inData?.id].map(({
                                                                                         id,
                                                                                         text,
                                                                                         textKk,
                                                                                         ispPrevInfo,
                                                                                         content,
                                                                                         contentKk
                                                                                       }) => {
              return (
                  <li key={id} className='help-list__item' onClick={() => openModal(ispPrevInfo, text, textKk, content, contentKk)}>
                          <span>
                            {locale === 'ru' ? text : textKk}
                          </span>
                    <svg
                        width="24"
                        height="24"
                        viewBox="0 0 24 24"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                          d="M14.4297 5.92999L20.4997 12L14.4297 18.07"
                          stroke='var(--color-primary)'
                          strokeWidth="1.5"
                          strokeMiterlimit="10"
                          strokeLinecap="round"
                          strokeLinejoin="round"
                      />
                      <path
                          d="M3.5 12H20.33"
                          stroke='var(--color-primary)'
                          strokeWidth="1.5"
                          strokeMiterlimit="10"
                          strokeLinecap="round"
                          strokeLinejoin="round"
                      />
                    </svg>
                  </li>)
            })}
          </ul>
        </div>
        {inData && inData?.id !== 2 && <div className="consultation-blank">
          <h3 className="consultation-blank__title">
            {translations[locale].needLegalAdvice}
          </h3>
          {/*<div className="consultation-blank__desc">*/}
          {/*  {translations[locale].needLegalAdvice}*/}
          {/*  &nbsp;Можете обратится к нашим юристам*/}
          {/*</div>*/}
          <Link className="item-btn item-btn--primary" href="https://api.whatsapp.com/send?phone=77478699525"
                target='_blank' style={{justifyContent: 'center'}}><span>{translations[locale].contactKamkor}</span>
          </Link>
        </div>}
      </div>
    </div>
  </div>)
}